tap "adoptopenjdk/openjdk"
tap "codefalling/fcitx-remote-for-osx"
tap "d12frosted/emacs-plus"
tap "denji/nginx"
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "srkomodo/tap"
tap "v2ray/v2ray"
brew "autoconf-archive"
brew "automake"
brew "bandwhich"
brew "bat"
brew "cairo"
brew "llvm"
brew "ccls"
brew "cmake"
brew "consul"
brew "consul-template"
brew "coreutils"
brew "diskus"
brew "dust"
brew "gnutls"
brew "emacs"
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "jpeg"
brew "gdb"
brew "python"
brew "giflib"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gmime"
brew "gnu-typist"
brew "graphicsmagick"
brew "ncurses"
brew "htop"
brew "imagemagick"
brew "imagemagick@6"
brew "isync"
brew "jq"
brew "pango"
brew "libvterm"
brew "llnode"
brew "logrotate"
brew "lsd"
brew "lua"
brew "ninja"
brew "meson"
brew "mit-scheme"
brew "mono"
brew "mu"
brew "mysql@5.7", restart_service: true, link: true
brew "neofetch"
brew "neovim"
brew "nginx", link: false
brew "nss"
brew "offlineimap", restart_service: true
brew "pkcs11-helper"
brew "openvpn"
brew "pandoc"
brew "tree"
brew "pass"
brew "pinentry-mac"
brew "pkg-config"
brew "plantuml"
brew "poppler"
brew "privoxy", restart_service: true
brew "protobuf"
brew "ranger"
brew "rapidjson"
brew "redis", restart_service: true
brew "ripgrep"
brew "rlwrap"
brew "siege"
brew "sk"
brew "tdlib"
brew "telnet"
brew "tmux"
brew "trash"
brew "wget"
brew "yadm"
brew "yasm"
brew "zeromq"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus", args: ["without-spacemacs-icon"], link: false
brew "denji/nginx/nginx-full", args: ["with-lua-module", "with-set-misc-module"]
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-modules", "with-rsvg"], link: false
brew "srkomodo/tap/shadowfox-updater"
brew "v2ray/v2ray/v2ray-core"
cask "adoptopenjdk"
cask "alfred"
cask "amethyst"
cask "docker"
cask "dotnet"
cask "dozer"
cask "font-cascadia"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "hammerspoon"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "keycastr"
cask "obs"
cask "qutebrowser"
cask "soundflower"
cask "squirrel"
cask "the-unarchiver"
cask "typora"
