tap "d12frosted/emacs-plus"
tap "denji/nginx"
tap "homebrew/bundle"
tap "homebrew/services"
brew "python@3.11"
brew "autojump"
brew "automake"
brew "bandwhich"
brew "bash"
brew "bat"
brew "clash", restart_service: true
brew "cloc"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "ctags"
brew "diskus"
brew "dust"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "graphviz"
brew "hey"
brew "htop"
brew "lazygit"
brew "libvterm"
brew "llnode"
brew "lsd"
brew "mkcert"
brew "mu"
brew "neofetch"
brew "neovim"
brew "offlineimap"
brew "opam"
brew "pandoc"
brew "plantuml"
brew "poppler"
brew "ranger"
brew "redis", restart_service: true
brew "ripgrep"
brew "rlwrap"
brew "rust-analyzer"
brew "thrift@0.9"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yadm"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["HEAD", "with-modern-icon", "with-xwidgets"]
brew "denji/nginx/nginx-full"
cask "alacritty"
cask "alfred"
cask "charles"
cask "docker"
cask "dozer"
cask "font-jetbrains-mono"
cask "hammerspoon"
cask "itsycal"
cask "karabiner-elements"
cask "keycastr"
cask "qutebrowser"
cask "the-unarchiver"
cask "typora"
cask "visual-studio-code"
