tap "adoptopenjdk/openjdk"
tap "codefalling/fcitx-remote-for-osx"
tap "d12frosted/emacs-plus"
tap "denji/nginx"
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "kak-lsp/kak-lsp"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "srkomodo/tap"
tap "v2ray/v2ray"
brew "autoconf-archive"
brew "automake"
brew "bandwhich"
brew "bash"
brew "bat"
brew "openssl@1.1"
brew "glib"
brew "python@3.8"
brew "cairo"
brew "llvm"
brew "ccls"
brew "cmake"
brew "consul"
brew "consul-template"
brew "coreutils"
brew "diskus"
brew "dust"
brew "pkg-config"
brew "jansson"
brew "jemalloc"
brew "gnutls"
brew "emacs", link: false
brew "exa"
brew "fd"
brew "giflib"
brew "gobject-introspection"
brew "harfbuzz"
brew "jpeg"
brew "zeromq"
brew "fish"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gdb"
brew "gdk-pixbuf"
brew "gifski"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-sed"
brew "gnu-typist"
brew "lua"
brew "pango"
brew "qt"
brew "gnuplot"
brew "go"
brew "gperf"
brew "graphicsmagick"
brew "ncurses"
brew "htop"
brew "imagemagick"
brew "imagemagick@6"
brew "isync"
brew "jq"
brew "kakoune"
brew "lazygit"
brew "librsvg"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "llnode"
brew "logrotate"
brew "lrzsz"
brew "lsd"
brew "luarocks"
brew "ninja"
brew "meson"
brew "mit-scheme"
brew "mono"
brew "msgpack"
brew "mu"
brew "mysql@5.7", restart_service: true, link: true
brew "neofetch"
brew "neovim"
brew "nginx", link: false
brew "nss"
brew "offlineimap", restart_service: true
brew "openjdk"
brew "pkcs11-helper"
brew "openvpn", restart_service: true
brew "osx-cpu-temp"
brew "pandoc"
brew "tree"
brew "pass"
brew "pinentry-mac"
brew "plantuml"
brew "poppler"
brew "privoxy", restart_service: true
brew "protobuf"
brew "pyenv"
brew "ranger"
brew "rapidjson"
brew "redis", restart_service: true
brew "ripgrep"
brew "rlwrap"
brew "siege"
brew "sk"
brew "swig"
brew "tdlib", link: false
brew "telnet"
brew "tmux"
brew "trash"
brew "watch"
brew "wget"
brew "yadm"
brew "yasm"
brew "zookeeper"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["HEAD", "with-modern-icon", "with-xwidgets"]
brew "denji/nginx/nginx-full", args: ["with-lua-module", "with-set-misc-module"]
brew "kak-lsp/kak-lsp/kak-lsp"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-rsvg"], link: false
brew "srkomodo/tap/shadowfox-updater"
brew "v2ray/v2ray/v2ray-core"
cask "adoptopenjdk"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "docker"
cask "dotnet"
cask "dozer"
cask "font-cascadia"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-hanamina"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "hammerspoon"
cask "istat-menus"
cask "iterm2"
cask "keycastr"
cask "obs"
cask "qutebrowser"
cask "soundflower"
cask "squirrel"
cask "the-unarchiver"
cask "typora"
cask "virtualbox"
